Tekla.Structures.ModelInternal.BuildingHierarchy.dotBuildingObjectOperationsEnum
Defines building object operations done on Tekla Structures core side

Tekla.Structures.ModelInternal.BuildingHierarchy.dotBuildingObjectOperationsEnum.DOT_BUILDING_CREATE_OBJECT
The creation of new object.

Tekla.Structures.ModelInternal.BuildingHierarchy.dotBuildingObjectOperationsEnum.DOT_BUILDING_MODIFY_OBJECT
Update the object.

Tekla.Structures.ModelInternal.BuildingHierarchy.dotBuildingObjectOperationsEnum.DOT_BUILDING_SELECT_OBJECT
Select the object.

Tekla.Structures.ModelInternal.BuildingHierarchy.dotBuildingObjectOperationsEnum.DOT_BUILDING_DELETE_OBJECT
Delete the object.